Bunkering_11/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 1.2943e-02; // background I=5%, U=7.0 m/s (SW wind), L=1m (turbulence_initial_conditions_case11.py)

boundaryField
{
    right               { type inletOutlet; inletValue $internalField; value $internalField; }
    left                { type inletOutlet; inletValue $internalField; value $internalField; }
    front               { type inletOutlet; inletValue $internalField; value $internalField; }
    back                { type inletOutlet; inletValue $internalField; value $internalField; }
    top                 { type inletOutlet; inletValue $internalField; value $internalField; }
    bottom              { type epsilonWallFunction; value $internalField; }
    bunkering-boat_m    { type epsilonWallFunction; value $internalField; }
    bunkering-quay_larger_m    { type epsilonWallFunction; value $internalField; }
    nozzle_holder_wall  { type epsilonWallFunction; value $internalField; }
    nozzle              { type turbulentMixingLengthDissipationRateInlet; mixingLength 3.22e-3; value uniform 6.0e6; } // l = 0.07*D, D=46mm
}
// ************************************************************************* //
