Bunkering_11/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//create nozzle
    {
        name    nozzle;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "bunkering-nozzle_up_m";
            }
    }
    {
        name    nozzle;
        type    faceSet;
        action  subset;
        source  boxToFace;
        // 310mm square nozzle, user-provided CAD geometry
        // (bunkering_nozzle_up_310mm_m.stl): exit cap is recessed at
        // z=6.69m (NOT 7.0m -- see flagged discrepancy in
        // documentation/notional_nozzle_reduced_velocity_plan.md)
        box (-0.155 -0.155 6.6885)(0.155 0.155 6.6915);
    }
//create nozzle_holder_wall
    {
        name    nozzle_holder_wall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "bunkering-nozzle_up_m";
            }
    }
    {
        name    nozzle_holder_wall;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     nozzle;
    }
);


// ************************************************************************* //
